spec/dummy/app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (name like '%ha%')

  def create
    @user = User.create params[:user]
---
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 05 Jan 2012 15:43:29 UTC +00:00], ["name", "Patrick Bartels"], ["updated_at", Thu, 05 Jan 2012 15:43:29 UTC +00:00]]

  def signin
    @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]